Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Redirects users directly to a project or component instead of showing the dashboard. You can either set it to ``True`` so it only works if there is actually only single project in Weblate. Alternatively, set the project slug, and it will redirect unconditionally to this project.
sv: Omdirigerar anvÃ¤ndare direkt till ett projekt eller en komponent istÃ¤llet fÃ¶r att visa instrumentpanelen. Du kan antingen stÃ¤lla in den pÃ¥ ``True`` sÃ¥ att den bara fungerar om det faktiskt bara finns ett enda projekt i Weblate. Alternativt kan du stÃ¤lla in projektets slug, och dÃ¥ kommer den att omdirigera villkorslÃ¶st till detta projekt.

source: Allows adding custom parameters when Weblate is invoking SSH. Useful when connecting to servers using legacy encryption or other non-standard features.
sv: GÃ¶r det mÃ¶jligt att lÃ¤gga till anpassade parametrar nÃ¤r Weblate anropar SSH. AnvÃ¤ndbart vid anslutning till servrar som anvÃ¤nder Ã¤ldre kryptering eller andra icke-standardfunktioner.

source: For example when SSH connection in Weblate fails with `Unable to negotiate with legacyhost: no matching key exchange method found. Their offer: diffie-hellman-group1-sha1`, you can turn that on using:
sv: Om till exempel SSH-anslutningen i Weblate misslyckas med `Unable to negotiate with legacyhost: no matching key exchange method found. Their offer: diffie-hellman-group1-sha1`, kan du aktivera det med:

source: The string is evaluated by the shell, so ensure any whitespace and special characters is quoted.
sv: StrÃ¤ngen utvÃ¤rderas av skalet, sÃ¥ se till att alla blanktecken och specialtecken Ã¤r inom citationstecken.

source: The URL where your Weblate instance reports its status.
sv: Den URL dÃ¤r din Weblate-instans rapporterar sin status.

source: Automatically deletes suggestions after a given number of days. Defaults to ``None``, meaning no deletions.
sv: Raderar automatiskt fÃ¶rslag efter ett visst antal dagar. StandardinstÃ¤llningen Ã¤r ``Ingen``, vilket innebÃ¤r att inga raderingar gÃ¶rs.

source: Disables semiannual support status check and redirecting superusers upon login to the donation page in case there is no active support subscription.
sv: Inaktiverar halvÃ¥rlig kontroll av supportstatus och omdirigering av superanvÃ¤ndare vid inloggning till donationssidan om det inte finns nÃ¥got aktivt supportabonnemang.

source: Improve your Weblate experience by purchasing a support subscription and boosting Weblate progress instead of turning this off.
sv: FÃ¶rbÃ¤ttra din upplevelse av Weblate genom att kÃ¶pa ett supportabonnemang och pÃ¥skynda utvecklingen av Weblate istÃ¤llet fÃ¶r att stÃ¤nga av den hÃ¤r funktionen.

source: Configures when the :guilabel:`Component seems unused` alert is triggered.
sv: Konfigurerar nÃ¤r varningen :guilabel:`Komponenten verkar oanvÃ¤nd` utlÃ¶ses.

source: Defaults to 365 days, set to 0 to turn it off.
sv: StandardinstÃ¤llningen Ã¤r 365 dagar. StÃ¤ll in pÃ¥ 0 fÃ¶r att stÃ¤nga av funktionen.

source: Controls whether languages database should be updated when running database migration and is on by default. This setting has no effect on invocation of :wladmin:`setuplang`.
sv: Styr om sprÃ¥kdatabasen ska uppdateras nÃ¤r databasmigrering kÃ¶rs och Ã¤r aktiverad som standard. Denna instÃ¤llning har ingen inverkan pÃ¥ anropet av :wladmin:`setuplang`.

source: The languages display might become inconsistent with this. Weblate language definitions expand over time and it will not display language code for the defined languages.
sv: SprÃ¥kinformationen kan bli inkonsekvent pÃ¥ grund av detta. Weblates sprÃ¥kinformation utÃ¶kas med tiden och sprÃ¥kkoderna fÃ¶r de definierade sprÃ¥ken visas inte.

source: This setting allows you to run Weblate under some path (otherwise it relies on being run from the webserver root).
sv: Denna instÃ¤llning gÃ¶r det mÃ¶jligt att kÃ¶ra Weblate under en viss sÃ¶kvÃ¤g (annars mÃ¥ste det kÃ¶ras frÃ¥n webbserverns rotkatalog).

source: To use this setting, you also need to configure your server to strip this prefix. For example with WSGI, this can be achieved by setting ``WSGIScriptAlias``.
sv: FÃ¶r att kunna anvÃ¤nda denna instÃ¤llning mÃ¥ste du ocksÃ¥ konfigurera din server sÃ¥ att prefixet tas bort. Med WSGI kan detta till exempel gÃ¶ras genom att stÃ¤lla in ``WSGIScriptAlias``.

source: The prefix should start with a ``/``.
sv: Prefixet ska bÃ¶rja med ett ``/``.

source: This setting does not work with Django's built-in server, you would have to adjust :file:`urls.py` to contain this prefix.
sv: Denna instÃ¤llning fungerar inte med Djangos inbyggda server, du mÃ¥ste justera :file:`urls.py` sÃ¥ att den innehÃ¥ller detta prefix.

source: A set of hosts to allow when configuring VCS URL. Defaults to an empty set what does no filtering at all.
sv: En uppsÃ¤ttning vÃ¤rdar som ska tillÃ¥tas vid konfigurering av VCS-URL. StandardinstÃ¤llningen Ã¤r en tom uppsÃ¤ttning som inte filtrerar alls.

source: A set of hosts to allow when configuring VCS URL. Only ``https`` and ``ssh`` are allowed by default.
sv: En uppsÃ¤ttning vÃ¤rdar som tillÃ¥ts vid konfigurering av VCS-URL. Endast ``https`` och ``ssh`` Ã¤r tillÃ¥tna som standard.

source: Configures minimal delay in seconds between third-party API calls in :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-pagure`, and :ref:`vcs-azure-devops`.
sv: Konfigurerar minimal fÃ¶rdrÃ¶jning i sekunder mellan API-anrop frÃ¥n tredje part i :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-pagure` och :ref:`vcs-azure-devops`.

source: This rate-limits API calls from Weblate to these services to avoid overloading them.
sv: Denna hastighet begrÃ¤nsar API-anrop frÃ¥n Weblate till dessa tjÃ¤nster fÃ¶r att undvika Ã¶verbelastning.

source: If you are being limited by secondary rate-limiter at GitHub, increasing this might help.
sv: Om du begrÃ¤nsas av sekundÃ¤r hastighetsbegrÃ¤nsare pÃ¥ GitHub kan det hjÃ¤lpa att Ã¶ka denna.

source: The default value is 10.
sv: StandardvÃ¤rdet Ã¤r 10.

source: Configures timeout in seconds for third-party API calls such as forking or creating merge requests in :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-pagure`, and :ref:`vcs-azure-devops`.
sv: Konfigurerar timeout i sekunder fÃ¶r API-anrop frÃ¥n tredje part, till exempel fÃ¶r att fÃ¶rgrena eller skapa sammanfogningsfÃ¶rfrÃ¥gningar i :ref:`vcs-github`, :ref:`vcs-gitlab`, :ref:`vcs-gitea`, :ref:`vcs-pagure` och :ref:`vcs-azure-devops`.

source: Configuration of available VCS backends.
sv: Konfiguration av tillgÃ¤ngliga VCS-backends.

source: Weblate tries to use all supported back-ends you have the tools for.
sv: Weblate fÃ¶rsÃ¶ker anvÃ¤nda alla stÃ¶dda back-ends som du har verktyg fÃ¶r.

source: You can limit choices or add custom VCS back-ends by using this.
sv: Du kan begrÃ¤nsa valmÃ¶jligheterna eller lÃ¤gga till anpassade VCS-backend genom att anvÃ¤nda detta.

source: Configures how deep cloning of repositories Weblate should do.
sv: Konfigurerar hur djup kloning av repositorier Weblate ska gÃ¶ra.

source: Currently this is only supported in :ref:`vcs-git`. By default Weblate does shallow clones of the repositories to make cloning faster and save disk space. Depending on your usage (for example when using custom :ref:`addons`), you might want to increase the depth or turn off shallow clones completely by setting this to 0.
sv: FÃ¶r nÃ¤rvarande stÃ¶ds detta endast i :ref:`vcs-git`. Som standard gÃ¶r Weblate ytliga kloner av arkiven fÃ¶r att gÃ¶ra kloningen snabbare och spara diskutrymme. Beroende pÃ¥ hur du anvÃ¤nder det (till exempel nÃ¤r du anvÃ¤nder anpassade :ref:`addons`) kanske du vill Ã¶ka djupet eller stÃ¤nga av ytliga kloner helt genom att stÃ¤lla in detta till 0.

source: In case you get ``fatal: protocol error: expected old/new/ref, got 'shallow <commit hash>'`` error when pushing from Weblate, turn off shallow clones completely by setting:
sv: Om du fÃ¥r felmeddelandet ``fatal: protocol error: expected old/new/ref, got 'shallow <commit hash>'`` nÃ¤r du pushar frÃ¥n Weblate, stÃ¤ng av shallow clones helt genom att stÃ¤lla in:

source: List of add-ons available for use. To use them, they have to be enabled for a given translation component. By default this includes all built-in add-ons, when extending the list you will probably want to keep existing ones enabled, for example:
sv: Lista Ã¶ver tillÃ¤gg som Ã¤r tillgÃ¤ngliga fÃ¶r anvÃ¤ndning. FÃ¶r att kunna anvÃ¤nda dem mÃ¥ste de aktiveras fÃ¶r en viss Ã¶versÃ¤ttningskomponent. Som standard inkluderar detta alla inbyggda tillÃ¤gg. NÃ¤r du utÃ¶kar listan vill du fÃ¶rmodligen behÃ¥lla de befintliga aktiverade, till exempel:

source: Removing the add-on from the list does not uninstall it from the components. Weblate will crash in that case. Please uninstall the add-on from all components prior to removing it from this list.
sv: Att ta bort tillÃ¤gget frÃ¥n listan avinstallerar det inte frÃ¥n komponenterna. Weblate kommer i sÃ¥ fall att krascha. Avinstallera tillÃ¤gget frÃ¥n alla komponenter innan du tar bort det frÃ¥n listan.

source: Configures how long activity logs for add-ons are kept. Defaults to 180 days.
sv: Konfigurerar hur lÃ¤nge aktivitetsloggar fÃ¶r tillÃ¤gg sparas. StandardinstÃ¤llningen Ã¤r 180 dagar.

source: List of a available exporters offering downloading translations or glossaries in various file formats.
sv: Lista Ã¶ver tillgÃ¤ngliga exportÃ¶rer som erbjuder nedladdning av Ã¶versÃ¤ttningar eller ordlistor i olika filformat.

source: List of file formats available for use.
sv: Lista Ã¶ver filformat som kan anvÃ¤ndas.

source: The default list already has the common formats.
sv: Standardlistan innehÃ¥ller redan de vanligaste formaten.

source: List of machinery services available for use.
sv: Lista Ã¶ver tillgÃ¤ngliga maskintjÃ¤nster.

source: Identity used by Weblate to sign Git commits, for example:
sv: Identitet som anvÃ¤nds av Weblate fÃ¶r att signera Git-commits, till exempel:

source: The Weblate GPG keyring is searched for a matching key (:file:`home/.gnupg` under :setting:`DATA_DIR`). If not found, a key is generated, please check :ref:`gpg-sign` for more details.
sv: Weblate GPG-nyckelringen sÃ¶ks efter en matchande nyckel (:file:`home/.gnupg` under :setting:`DATA_DIR`). Om ingen hittas genereras en nyckel. Se :ref:`gpg-sign` fÃ¶r mer information.

source: Defines whether :ref:`project-web` has to be specified when creating a project. On by default, as that suits public server setups.
sv: Definierar om :ref:`project-web` mÃ¥ste anges nÃ¤r ett projekt skapas. StandardinstÃ¤llningen Ã¤r pÃ¥, eftersom det passar offentliga serverkonfigurationer.

source: Configuring version control credentials
sv: Konfigurera autentiseringsuppgifter fÃ¶r versionshantering

source: This section describes VCS credential variables as :setting:`GITHUB_CREDENTIALS`, :setting:`GITLAB_CREDENTIALS`, :setting:`GITEA_CREDENTIALS`, :setting:`PAGURE_CREDENTIALS`, :setting:`BITBUCKETSERVER_CREDENTIALS`.
sv: I detta avsnitt beskrivs VCS-autentiseringsvariabler som :setting:`GITHUB_CREDENTIALS`, :setting:`GITLAB_CREDENTIALS`, :setting:`GITEA_CREDENTIALS`, :setting:`PAGURE_CREDENTIALS`, :setting:`BITBUCKETSERVER_CREDENTIALS`.

source: The credentials can also be overridden in :ref:`component-push` or :ref:`component-repo` (if push URL is not configured), these take precedence over the ones specified in the configuration file.
sv: Autentiseringsuppgifterna kan ocksÃ¥ Ã¥sidosÃ¤ttas i :ref:`component-push` eller :ref:`component-repo` (om push-URL inte Ã¤r konfigurerad), dessa har fÃ¶retrÃ¤de framfÃ¶r de som anges i konfigurationsfilen.

source: API user, required.
sv: API-anvÃ¤ndare, krÃ¤vs.

source: Scheme override. Weblate attempts to parse scheme from the repository URL and falls backs to ``https``. If you are running the API server internally, you might want to use ``http`` instead, but consider security.
sv: SchemaÃ¶verskrivning. Weblate fÃ¶rsÃ¶ker analysera schemat frÃ¥n repositoriets URL och faller tillbaka till ``https``. Om du kÃ¶r API-servern internt kanske du vill anvÃ¤nda ``http`` istÃ¤llet, men tÃ¤nk pÃ¥ sÃ¤kerheten.

source: In the Docker container, the credentials can be configured using environment variables, see :ref:`docker-vcs-config`.
sv: I Docker-containern kan autentiseringsuppgifterna konfigureras med hjÃ¤lp av miljÃ¶variabler, se :ref:`docker-vcs-config`.

source: Continuous localization
sv: Kontinuerlig lokalisering

source: There is infrastructure in place so that your translation closely follows development. This way translators can work on translations the entire time, instead of working through huge amount of new text just prior to release.
sv: Det finns infrastruktur pÃ¥ plats sÃ¥ att din Ã¶versÃ¤ttning fÃ¶ljer utvecklingen noggrant. PÃ¥ sÃ¥ sÃ¤tt kan Ã¶versÃ¤ttarna arbeta med Ã¶versÃ¤ttningarna hela tiden, istÃ¤llet fÃ¶r att behÃ¶va ta sig an en enorm mÃ¤ngd ny text strax fÃ¶re lanseringen.

source: :doc:`/devel/integration` describes basic ways to integrate your development with Weblate.
sv: :doc:`/devel/integration` beskriver grundlÃ¤ggande sÃ¤tt att integrera din utveckling med Weblate.

source: This is the process:
sv: SÃ¥ hÃ¤r gÃ¥r det till:

source: Developers make changes and push them to the VCS repository.
sv: Utvecklare gÃ¶r Ã¤ndringar och Ã¶verfÃ¶r dem till VCS-arkivet.

source: Optionally the translation files are updated, see :ref:`translations-update`.
sv: Om sÃ¥ Ã¶nskas uppdateras Ã¶versÃ¤ttningsfilerna, se :ref:`translations-update`.

source: Weblate pulls changes from the VCS repository, parses translation files and updates its database, see :ref:`update-vcs`.
sv: Weblate hÃ¤mtar Ã¤ndringar frÃ¥n VCS-arkivet, analyserar Ã¶versÃ¤ttningsfiler och uppdaterar sin databas, se :ref:`update-vcs`.

source: Translators submit translations using the Weblate web interface, or upload offline changes.
sv: ÃversÃ¤ttare skickar in Ã¶versÃ¤ttningar via Weblate-webbgrÃ¤nssnittet eller laddar upp Ã¤ndringar offline.

source: Once the translators are finished, Weblate commits the changes to the local repository (see :ref:`lazy-commit`).
sv: NÃ¤r Ã¶versÃ¤ttarna Ã¤r klara Ã¶verfÃ¶r Weblate Ã¤ndringarna till det lokala arkivet (se :ref:`lazy-commit`).

source: Changes are pushed back to the upstream repository (see :ref:`push-changes`).
sv: Ãndringarna skickas tillbaka till uppstrÃ¶msrepositoriet (se :ref:`push-changes`).

source: Upstream code hosting is not necessary, you can use Weblate with :ref:`vcs-local` where there is only the repository inside Weblate.
sv: Upstream-kodhosting Ã¤r inte nÃ¶dvÃ¤ndigt, du kan anvÃ¤nda Weblate med :ref:`vcs-local` dÃ¤r det endast finns ett arkiv inuti Weblate.

source: Updating repositories
sv: Uppdatering av filfÃ¶rrÃ¥den

source: You should set up some way of updating backend repositories from their source.
sv: Du bÃ¶r skapa nÃ¥got sÃ¤tt att uppdatera backend-arkiv frÃ¥n deras kÃ¤lla.

source: Use :ref:`hooks` to integrate with most of common code hosting services:
sv: AnvÃ¤nd :ref:`hooks` fÃ¶r att integrera med de flesta vanliga kodhostingtjÃ¤nster:

source: You must also :ref:`project-enable_hooks` for this to work.
sv: Du mÃ¥ste ocksÃ¥ :ref:`project-enable_hooks` fÃ¶r att detta ska fungera.

source: Manually trigger update either in the repository management or using :ref:`api` or :ref:`wlc`
sv: Starta uppdateringen manuellt antingen i repositoriefÃ¶rvaltningen eller med hjÃ¤lp av :ref:`api` eller :ref:`wlc`

source: Enable :setting:`AUTO_UPDATE` to automatically update all components on your Weblate instance
sv: Aktivera :setting:`AUTO_UPDATE` fÃ¶r att automatiskt uppdatera alla komponenter pÃ¥ din Weblate-instans

source: Execute :wladmin:`updategit` (with selection of project or ``--all`` to update all)
sv: KÃ¶r :wladmin:`updategit` (med val av projekt eller ``--all`` fÃ¶r att uppdatera alla)

source: Whenever Weblate updates the repository, the post-update addons will be triggered, see :ref:`addons`.
sv: NÃ¤r Weblate uppdaterar arkivet kommer tillÃ¤ggen efter uppdateringen att aktiveras, se :ref:`addons`.

source: Avoiding merge conflicts
sv: Undvika sammanfogningskonflikter

source: The merge conflicts from Weblate arise when same file was changed both in Weblate and outside it. Depending on the situation, there are several approaches that might help here:
sv: Konflikter vid sammanslagning frÃ¥n Weblate uppstÃ¥r nÃ¤r samma fil har Ã¤ndrats bÃ¥de i Weblate och utanfÃ¶r det. Beroende pÃ¥ situationen finns det flera tillvÃ¤gagÃ¥ngssÃ¤tt som kan hjÃ¤lpa hÃ¤r:

source: Avoiding merge conflicts by changing translation files in Weblate only
sv: Undvik konflikter vid sammanslagning genom att endast Ã¤ndra Ã¶versÃ¤ttningsfiler i Weblate

source: Avoiding edits outside Weblate is easy with monolingual files â you can add new strings within Weblate and leave whole editing of the files there. For bilingual files, there is usually some kind of message extraction process to generate translatable files from the source code. In some cases, this can be split into two parts:
sv: Det Ã¤r enkelt att undvika redigeringar utanfÃ¶r Weblate med ensprÃ¥kiga filer â du kan lÃ¤gga till nya strÃ¤ngar i Weblate och lÃ¤mna all redigering av filerna dÃ¤r. FÃ¶r tvÃ¥sprÃ¥kiga filer finns det vanligtvis nÃ¥gon form av meddelandeutvinningsprocess fÃ¶r att generera Ã¶versÃ¤ttningsbara filer frÃ¥n kÃ¤llkoden. I vissa fall kan detta delas upp i tvÃ¥ delar:

source: The extraction generates template (for example gettext POT is generated using :program:`xgettext`).
sv: Extraheringen genererar en mall (till exempel genereras gettext POT med hjÃ¤lp av :program:`xgettext`).

source: Further process merges it into actual translations (the gettext PO files are updated using :program:`msgmerge`).
sv: Vidare bearbetning sammanfogar det till faktiska Ã¶versÃ¤ttningar (gettext PO-filerna uppdateras med hjÃ¤lp av :program:`msgmerge`).

source: You can perform the second step within Weblate and it will ensure that all pending changes are included before this operation.
sv: Du kan utfÃ¶ra det andra steget i Weblate, vilket sÃ¤kerstÃ¤ller att alla vÃ¤ntande Ã¤ndringar inkluderas fÃ¶re denna Ã¥tgÃ¤rd.

source: Avoiding merge conflicts by locking Weblate while doing outside changes
sv: Undvik konflikter vid sammanslagning genom att lÃ¥sa Weblate nÃ¤r du gÃ¶r Ã¤ndringar utanfÃ¶r

source: Integrating Weblate into your updating process so that it flushes changes before updating the files outside Weblate can be achieved by using :ref:`api` to force Weblate to push all pending changes and lock the translation while you are doing changes on your side.
sv: Du kan integrera Weblate i din uppdateringsprocess sÃ¥ att Ã¤ndringarna spolas innan filerna utanfÃ¶r Weblate uppdateras genom att anvÃ¤nda :ref:`api` fÃ¶r att tvinga Weblate att skicka alla vÃ¤ntande Ã¤ndringar och lÃ¥sa Ã¶versÃ¤ttningen medan du gÃ¶r Ã¤ndringar pÃ¥ din sida.

source: The script for doing updates can look like this:
sv: Skriptet fÃ¶r att gÃ¶ra uppdateringar kan se ut sÃ¥ hÃ¤r:

source: If you have multiple components sharing the same repository, you need to lock them all separately:
sv: Om du har flera komponenter som delar samma arkiv mÃ¥ste du lÃ¥sa dem alla separat:

source: The example uses :ref:`wlc`, which needs configuration (API keys) to be able to control Weblate remotely. You can also achieve this using any HTTP client instead of :ref:`wlc`, for example curl, see :ref:`api`.
sv: I exemplet anvÃ¤nds :ref:`wlc`, som behÃ¶ver konfigureras (API-nycklar) fÃ¶r att kunna styra Weblate pÃ¥ distans. Du kan ocksÃ¥ uppnÃ¥ detta med hjÃ¤lp av valfri HTTP-klient istÃ¤llet fÃ¶r :ref:`wlc`, till exempel curl, se :ref:`api`.

source: Avoiding merge conflicts by focusing on Git operations
sv: Undvik konflikter vid sammanslagningar genom att fokusera pÃ¥ Git-operationer

source: Even when Weblate is the single source of the changes in the translation files, conflicts can appear when using :ref:`addon-weblate.git.squash` add-on, :ref:`component-merge_style` is configured to :guilabel:`Rebase`, or you are squashing commits outside of Weblate (for example, when merging a pull request).
sv: Ãven nÃ¤r Weblate Ã¤r den enda kÃ¤llan till Ã¤ndringarna i Ã¶versÃ¤ttningsfilerna kan konflikter uppstÃ¥ nÃ¤r du anvÃ¤nder tillÃ¤gget :ref:`addon-weblate.git.squash`, :ref:`component-merge_style` Ã¤r konfigurerat till :guilabel:`Rebase` eller du squasherar commit utanfÃ¶r Weblate (till exempel nÃ¤r du sammanfogar en pull-begÃ¤ran).

source: The reason for merge conflicts is different in this case - there are changes in Weblate which happened after you merged Weblate commits. This typically happens if merging is not automated and waits for days or weeks for a human to review them. Git is then sometimes no longer able to identify upstream changes as matching the Weblate ones and refuses to perform a rebase.
sv: Orsaken till sammanfogningskonflikter Ã¤r annorlunda i detta fall â det har skett Ã¤ndringar i Weblate efter att du sammanfogade Weblate-commits. Detta intrÃ¤ffar vanligtvis om sammanfogningen inte Ã¤r automatiserad och man vÃ¤ntar i dagar eller veckor pÃ¥ att en mÃ¤nniska ska granska dem. Git kan dÃ¥ ibland inte lÃ¤ngre identifiera uppstrÃ¶msÃ¤ndringar som matchande Weblate-Ã¤ndringar och vÃ¤grar att utfÃ¶ra en rebase.

source: To approach this, you either need to minimize the amount of pending changes in Weblate when you merge a pull request, or avoid the conflicts completely by not squashing changes.
sv: FÃ¶r att lÃ¶sa detta mÃ¥ste du antingen minimera antalet vÃ¤ntande Ã¤ndringar i Weblate nÃ¤r du sammanfogar en pull-begÃ¤ran, eller helt undvika konflikter genom att inte sammanfoga Ã¤ndringar.

source: Here are few options how to avoid that:
sv: HÃ¤r Ã¤r nÃ¥gra alternativ fÃ¶r att undvika det:

source: Do not use neither :ref:`addon-weblate.git.squash` nor squashing at merge time. This is the root cause why git doesn't recognize changes after merging.
sv: AnvÃ¤nd varken :ref:`addon-weblate.git.squash` eller squashing vid sammanfogning. Detta Ã¤r den grundlÃ¤ggande orsaken till att git inte kÃ¤nner igen Ã¤ndringar efter sammanfogning.

source: Let Weblate commit pending changes before merging. This will update the pull request with all its changes, and both repositories will be in sync.
sv: LÃ¥t Weblate bekrÃ¤fta vÃ¤ntande Ã¤ndringar innan sammanslagning. Detta uppdaterar pull-begÃ¤ran med alla Ã¤ndringar, och bÃ¥da arkiven kommer att synkroniseras.

source: Use the review features in Weblate (see :doc:`/workflows`) so that you can automatically merge GitHub pull requests after CI passes.
sv: AnvÃ¤nd granskningsfunktionerna i Weblate (se :doc:`/workflows`) sÃ¥ att du automatiskt kan slÃ¥ samman GitHub-pullfÃ¶rfrÃ¥gningar efter att CI har godkÃ¤nts.

source: Use locking in Weblate to avoid changes while GitHub pull request is in review.
sv: AnvÃ¤nd lÃ¥sning i Weblate fÃ¶r att undvika Ã¤ndringar medan GitHub-pull-begÃ¤ran granskas.

source: Automatically receiving changes from GitHub
sv: Automatiskt ta emot Ã¤ndringar frÃ¥n GitHub

source: Weblate comes with native support for GitHub.
sv: Weblate har inbyggt stÃ¶d fÃ¶r GitHub.

source: If you are using Hosted Weblate, the recommended approach is to install the `Weblate app <https://github.com/apps/weblate>`_, that way you will get the correct setup without having to set much up. It can also be used for pushing changes back.
sv: Om du anvÃ¤nder Hosted Weblate rekommenderas att du installerar `Weblate-appen <https://github.com/apps/weblate>`_, sÃ¥ fÃ¥r du rÃ¤tt instÃ¤llningar utan att behÃ¶va gÃ¶ra sÃ¥ mycket sjÃ¤lv. Den kan ocksÃ¥ anvÃ¤ndas fÃ¶r att skicka tillbaka Ã¤ndringar.
